views/subjects/_form.php

SELECT * FROM `course`
---

    <div class="row">
        <div class="col-sm-6">
            <?= $form->field($model, 'course')->dropDownList(ArrayHelper::map(Course::find()->all(), 'id', 'course_name'),
                [       'prompt'=>'---Select course ---',
                        'onchange'=>'
                            $.get( "'.Url::toRoute('sem').'", { id: $(this).val() } )
                            .done(function( data ) {
                                $( "#'.Html::getInputId($model, 'sem_id').'" ).html( data );
                            }
                        );'
                ])->label(false) ;