controllers/AttendanceController.php

INSERT INTO `attendance` (`sub_id`, `stu_id`, `status`) VALUES (12, 12, 1)
---
    public function actionCreate()
    {
        $model = new Attendance();

        if ($model->load(Yii::$app->request->post()) && $model->save()) {