controllers/CourseController.php

    public function actionAdd()
    {
        $model = new Course();

        if ($model->load(Yii::$app->request->post()) && $model->save()) {
---
INSERT INTO `course` (`course_name`, `no_of_sem`) VALUES ('MBBS', 10)