controllers/SemesterController.php

SELECT * FROM `subjects` WHERE `sem_id`='1'
---
    public function actionTable($start=NULL,$end=NULL,$_=NULL, $id){
        \Yii::$app->response->format = \yii\web\Response::FORMAT_JSON;

        $events = array();
        $subs = Subjects::find()->where(['sem_id' => $id])->all();

INSERT INTO `semester` (`course_id`, `sem_name`, `no_of_subjects`, `start_date`, `end_date`) VALUES (1, 'level1 1stSem', 5, '2016-07-01', '2016-09-30')
---
    public function actionAdd()
    {
        $model = new Semester();

        if ($model->load(Yii::$app->request->post()) && $model->save()) {

SELECT * FROM `semester` WHERE `id`='1'
---
    protected function findModel($id)
    {
        if (($model = Semester::findOne($id)) !== null) {