views/semester/_form.php


    <?php $form = ActiveForm::begin(); ?>

    <?= $form->field($model, 'course_id')->dropDownList(ArrayHelper::map(Course::find()->all(), 'id', 'course_name'),
        [ 'prompt'=>'---Select Course ---']);
---
SELECT * FROM `course`