views/semester/index.php

SELECT * FROM `course` ORDER BY `course_name`
---
          return $model->course->course_name;
        },
    'filterType'=>GridView::FILTER_SELECT2,
    'filter'=>ArrayHelper::map(Course::find()->orderBy('course_name')->asArray()->all(), 'id', 'course_name'),

SELECT * FROM `subjects` WHERE `sem_id`=1
---
    'pageSummary'=>true,
    'footer'=>true
    ],
    [
    'class'=>'kartik\grid\DataColumn',
    'header'=>'Done',
    'value' =>function ($model, $key, $index, $widget) {
          $subjects = $model->subjects ;
          $total = 0;
          foreach ($subjects as $key => $value) { // Add less than Current Date , 'date' < date('Y-m-d')
            $count = Calender::find()
            ->where(['sub_id' => $value['id']])
            ->andWhere(['status' => 'done'])
            ->count();
            $total =+ $count;
          }
          return $total;
        },
    'hAlign'=>'center',
    'mergeHeader'=>true,
    'pageSummary'=>true,
    'footer'=>true
    ],